export const sphereOptions = [
  { label: 'Выберите сферу употребления слова', value: 0 },
  { label: 'Анатомия', value: 'Анатомия' },
  { label: 'Археология', value: 'Археология' },
  { label: 'Архитектура', value: 'Архитектура' },
  { label: 'Астрономия', value: 'Астрономия' },
  { label: 'Биология', value: 'Биология' },
  { label: 'Ботаника', value: 'Ботаника' },
  { label: 'Бухгалтерия', value: 'Бухгалтерия' },
  { label: 'Ветеренария', value: 'Ветеренария' },
  { label: 'География', value: 'География' },
  { label: 'Диалектизм', value: 'Диалектизм' },
  { label: 'Дипломатический термин', value: 'Дипломатический термин' },
  { label: 'Железнодорожное дело', value: 'Железнодорожное дело' },
  { label: 'Зоология', value: 'Зоология' },
  { label: 'Исторический термин', value: 'Исторический термин' },
  { label: 'Кулинария', value: 'Кулинария' },
  { label: 'Лингвистика', value: 'Лингвистика' },
  { label: 'Математика', value: 'Математика' },
  { label: 'Медицина', value: 'Медицина' },
  { label: 'Религия', value: 'Религия' },
  { label: 'Физкультура и спорт', value: 'Физкультура и спорт' },
  { label: 'Сельзкое хозяйство', value: 'Сельзкое хозяйство' },
  { label: 'Фармацептический термин', value: 'Фармацептический термин' },
  { label: 'Физика', value: 'Физика' },
  { label: 'Физиология', value: 'Физиология' },
  { label: 'Фольклор', value: 'Фольклор' },
  { label: 'Химия', value: 'Химия' },
  { label: 'Экономика', value: 'Экономика' },
  { label: 'Этнография', value: 'Этнография' },
  { label: 'Юридический термин', value: 'Юридический термин' }
];

export const originOptions = [
  { label: 'Выберите вариант происхождения слова', value: 0 },
  { label: 'Арабское слово', value: 'Арабское слово' },
  { label: 'Китайское слово', value: 'Китайское слово' },
  { label: 'Русское слово', value: 'Русское слово' },
  { label: 'Монгольский язык', value: 'Монгольский язык' },
  { label: 'Персидское слово', value: 'Персидское слово' },
  { label: 'Уйгурское слово', value: 'Уйгурское слово' },
  { label: 'Китайско-Уйгурское слово', value: 'Китайско-Уйгурское слово' },
  {
    label: 'Монгольско-Уйгурское слово',
    value: 'Могольско-Уйгурское слово'
  },
  { label: 'Русско-уйгурское слово', value: 'Русско-уйгурское слово' },
  { label: 'Арабско-Уйгурское слово', value: 'Арабско-Уйгурское слово' },
  { label: 'Персидско-Уйгурское слово', value: 'Персидско-Уйгурское слово' }
];

export const lexisOptions = [
  { label: 'Выберите лексику слова', value: 0 },
  { label: 'В переносном значении', value: 'В переносном значении' },
  { label: 'Малоупотребительно', value: 'Малоупотребительно' },
  { label: 'Поговорка', value: 'Поговорка' },
  { label: 'Пословица', value: 'Пословица' },
  { label: 'В разных значениях', value: 'В разных значениях' },
  { label: 'В прямом значении', value: 'В прямом значении' }
];

export const styleOptions = [
  { label: 'Выберите стиль слова', value: 0 },
  { label: 'Бранное слово', value: 'Бранное слово' },
  { label: 'Поэтическое слово', value: 'Поэтическое слово' },
  { label: 'Разговорное слово', value: 'Разговорное слово' },
  { label: 'Книжный стиль', value: 'Книжный стиль' },
  { label: 'Неодобрительно', value: 'Неодобрительно' },
  { label: 'В ироничном смысле', value: 'В ироничном смысле' }
];

export const partOfSpeechOptions = [
  { label: 'Выберите часть речи к которому принадлежит слово', value: 0 },
  { label: 'Вводное слово', value: 'Вводное слово' },
  {
    label: 'Вопросительное местоимение',
    value: 'Вопросительное местоимение'
  },
  { label: 'Вопросительная частица', value: 'Вопросительная частица' },
  { label: 'Глагол', value: 'Глагол' },
  {
    label: 'Количественное числительное',
    value: 'Количественное числительное'
  },
  {
    label: 'Существительное',
    value: 'Существительное'
  },
  {
    label: 'Порядковое числительное',
    value: 'Порядковое числительное'
  },
  {
    label: 'Междометие',
    value: 'Междометие'
  },
  {
    label: 'Звукоподражание',
    value: 'Звукоподражание'
  },
  {
    label: 'Личное местоимение',
    value: 'Личное местоимение'
  },
  {
    label: 'Местоимение',
    value: 'Местоимение'
  },
  {
    label: 'Отрицательная частица',
    value: 'Отрицательная частица'
  },
  {
    label: 'Имя прилагательное',
    value: 'Имя прилагательное'
  },
  {
    label: 'Причастие',
    value: 'Причастие'
  },
  {
    label: 'Разделительный союз',
    value: 'Разделительный союз'
  },
  {
    label: 'Собирательное существительное',
    value: 'Собирательное существительное'
  },
  {
    label: 'Соединительный союз',
    value: 'Соединительный союз'
  },
  {
    label: 'Указательное местоимение',
    value: 'Указательное местоимение'
  },
  {
    label: 'Число',
    value: 'Число'
  },
  {
    label: 'Усилительная частица',
    value: 'Усилительная частица'
  },
  {
    label: 'Утвердительная частица',
    value: 'Утвердительная частица'
  }
];

export const grammarOptions = [
  { label: 'Выберите грамматику слова', value: 0 },
  { label: 'Имя действия', value: 'Имя действия' },
  { label: 'Лицо глагола', value: 'Лицо глагола' },
  { label: 'Взаимный залог', value: 'Взаимный залог' },
  { label: 'Возвратный залог', value: 'Возвратный залог' },
  { label: 'Грамматика', value: 'Грамматика' },
  { label: 'Дательный падеж', value: 'Дательный падеж' },
  { label: 'Деепречастие', value: 'Деепречастие' },
  { label: 'Единственное число', value: 'Единственное число' },
  { label: 'Множественное число', value: 'Множественное число' },
  { label: 'Многократный вид глагола', value: 'Многократный вид глагола' },
  { label: 'Однократный вид глагола', value: 'Однократный вид глагола' },
  { label: 'Направительный падеж', value: 'Направительный падеж' },
  { label: 'Сравнительная степень', value: 'Сравнительная степень' },
  { label: 'Страдательный залог', value: 'Страдательный залог' },
  { label: 'Родительный падеж', value: 'Родительный падеж' },
  { label: 'Уменьшительная форма', value: 'Уменьшительная форма' }
];
